export const LocationNames = ['서울', '경기', '인천', '대전', '충북', '충남', '부산', '울산', '경북', '경남', '대구', '광주', '전북', '전남', '제주', '강원'];
export const ProjectRecruitFields = ['분야 전체', '프론트엔드', '백엔드', '풀스택', '안드로이드', 'iOS', '머신러닝', '게임', '임베디드', '블록체인', '기타'];
export const ProjectFields = ['분야 전체', '웹', '모바일 앱', '데스크톱 앱', '임베디드 시스템', 'AI', '게임', '로봇', '하드웨어', 'VR / AR', '기타'];
export const ProjectSubFields = ['분류 전체', '건강 및 피트니스', '교육 및 학습', '여행 및 지역 정보', '음식 및 요리', '사회 문제 해결', '엔터테인먼트', '쇼핑 및 전자상거래', '자기 계발 및 멘토링', '뉴스 및 미디어', '기술 및 혁신', '기타'];